[
  {
    "date": "2024-11-25",
    "title": "Trump Threatens Tariffs on Key Trade Partners",
    "description": "President-elect Trump signals plans to impose a 25% tariff on all products from Mexico, China, and Canada upon taking office."
  },
  {
    "date": "2025-01-20",
    "title": "Inauguration Day Tariff Focus",
    "description": "During his inauguration, President Trump announces the creation of the External Revenue Service to collect tariffs and pledges to use tariffs to boost U.S. wealth."
  },
  {
    "date": "2025-02-04",
    "title": "10% Tariff on All Chinese Imports",
    "description": "A 10% tariff is imposed on all Chinese imports, citing national security concerns including fentanyl trafficking."
  },
  {
    "date": "2025-02-25",
    "title": "Copper Tariff Evaluation Executive Order",
    "description": "President Trump signs an executive order instructing the Commerce Department to evaluate tariffs on imported copper for national security."
  },
  {
    "date": "2025-03-01",
    "title": "Lumber Tariff Evaluation Order",
    "description": "Executive order directs a national security review on tariffs for imported lumber and timber."
  },
  {
    "date": "2025-03-04",
    "title": "Major Tariffs on Canada, Mexico, and China",
    "description": "25% tariffs are imposed on Canadian and Mexican imports (10% for Canadian energy). Chinese tariffs double to 20%."
  },
  {
    "date": "2025-03-05",
    "title": "Temporary Exemptions for Auto Imports",
    "description": "U.S. automakers receive temporary exemptions from new tariffs on imports from Canada and Mexico."
  },
  {
    "date": "2025-03-10",
    "title": "China Retaliates with Agricultural Tariffs",
    "description": "China imposes 15% tariffs on U.S. agricultural goods, including chicken, pork, soybeans, and beef."
  },
  {
    "date": "2025-03-12",
    "title": "Steel and Aluminum Tariffs",
    "description": "25% tariffs go into effect on all imported steel and aluminum, removing prior exemptions."
  },
  {
    "date": "2025-03-24",
    "title": "Oil Tariff Linked to Venezuela Buyers",
    "description": "Executive order imposes a 25% tariff on imports from countries purchasing oil or gas from Venezuela, effective April 2."
  },
  {
    "date": "2025-03-26",
    "title": "Imported Cars Tariff Announced",
    "description": "25% tariffs on almost all imported cars announced, effective April 3. Auto parts tariffs planned for May 3."
  },
  {
    "date": "2025-04-02",
    "title": "Baseline 10% Tariff Plan Announced",
    "description": "President Trump announces a 10% baseline tariff on most countries, with higher rates for some nations."
  },
  {
    "date": "2025-04-03",
    "title": "25% Car Tariff Takes Effect",
    "description": "25% tariffs on imported cars are implemented as scheduled."
  },
  {
    "date": "2025-04-05",
    "title": "10% Tariff Policy Goes into Effect",
    "description": "The baseline 10% tariffs on most countries officially take effect."
  },
  {
    "date": "2025-04-08",
    "title": "Tariffs on China Rise to 104%",
    "description": "Tariffs on Chinese goods increase to 104%, including 90% tariffs on de minimis low-cost imports."
  },
  {
    "date": "2025-04-09",
    "title": "90-Day Pause on Non-China Tariffs",
    "description": "The Trump administration announces a 90-day delay in implementing new tariffs on most countries, excluding China."
  },
  {
    "date": "2025-04-11",
    "title": "Tech Goods Tariff Refund Policy",
    "description": "A memorandum expands reciprocal tariff exemptions to tech goods and provides refunds for tariffs collected since April 5."
  },
  {
    "date": "2025-04-15",
    "title": "Antidumping Tariff on Mexican Tomatoes",
    "description": "The administration announces a 21% antidumping tariff on most Mexican tomato imports, effective July 14."
  }
]
